[
{
    "id": "124410617",
    "method": "card",
    "heading":"Coldrif cough syrup linked to 20 child deaths",
    "category": "Prime",
    "card": [
        "Children die after consuming toxic cough syrup. The system’s broken. Here’s what’s shaking up the courts right now.",
        "Lawyer Vishal Tiwari isn’t backing down. He’s filed a PIL—demanding urgent action. But what’s really at stake?",
        "Multiple states report child deaths linked to one cough syrup. Investigations scatter. Accountability blurs. Everything’s up for grabs. Until...",
        "A Supreme Court bench steps in. They agree to hear the plea on October 10. Momentum builds. But is it enough?",
        "Everyone blames local regulators. Or isolated mistakes. They’re missing the real story.",
        "The real reason? Fragmented investigations let hazardous syrups slip through—again and again.",
        "Within months, the plea calls for transferring all FIRs and probes to the CBI. It demands a retired Supreme Court judge to oversee everything.",
        "This reveals something bigger: Without unified oversight, dangerous drugs keep hitting the shelves. Reform isn’t optional—it’s urgent.",
        "What's your take? Does India need a nationwide probe on drug safety? Drop your thoughts below."
    ]
},

{
    "id": "124446181",
    "method": "story",
    "heading":"OpenAI, Oracle sign USD300 billion cloud deal",
    "category": "Prime",
    "story": "OpenAI just locked $300 billion with Oracle’s cloud pact.\nNvidia dangles $100 billion—if OpenAI spends it on GPUs.\nAI’s future now hinges on financial loops, not code.\n\nOracle’s “revenue” is debt-fuelled, self-funded, and circular.\nNvidia’s investment returns instantly as hardware orders.\nThe same billions cycle back as “growth” for all sides.\nOpenAI morphs from lab to financial conduit overnight.\nSmaller AI startups can’t enter these billion-dollar loops.\n\nIs AI innovation now hostage to balance-sheet engineering?\nWhat happens when the circular flow breaks?\nWould you bet on these deals, or the real economy?" 
},

{
    "id": "124384933",
    "method": "summary",
    "heading":"India air passenger traffic drops 2% in July-August",
    "category": "Prime",
    "Summary": "Maruti Suzuki reports surging car sales, with showrooms staying open late and some models running out of stock, fueled by festive demand and GST cuts. While consumer spending lifts auto and appliance sectors, airlines face a 2% drop in passenger traffic and subdued fares, with visa restrictions and tech layoffs compounding the slowdown. Airlines brace for weaker earnings, as road trips replace flights this Diwali."
},

{
    "id": "124335389",
    "method": "card",
    "heading":"Amazon Fresh expands grocery delivery to 270 cities",
    "category": "Prime",
    "card": [
        "Amazon is quietly doubling its grocery delivery reach during the Great Indian Festival. Here's how they're rewriting the rules.",
        "Amazon Fresh was in 130 cities mid-2024. Now, it's in 270 cities. That's a massive leap. But there's more.",
        "They've expanded into tier-III and tier-IV towns like Kollam, Asansol, and Zirakpur. Deep coverage, deep ambition. Everything looked unstoppable. Until...",
        "The grocery delivery market got shaken up. Quick commerce upstarts like Blinkit, Instamart, and Zepto started changing the game.",
        "Everyone thought Amazon would pivot away from slotted deliveries—like everyone else did. They were wrong.",
        "The real strategy? Amazon is running a dual-track: quick deliveries under 30 minutes with 'Now' and 3-hour batched slots with 'Fresh'.",
        "Within two years, Amazon Fresh's product selection grew 10x to 40,000. Amazon Now launched in Bangalore, Delhi, and Mumbai—covering most of 102 PIN codes in Bangalore.",
        "This reveals something bigger: Amazon isn't just chasing speed—it's betting big on both reach and selection, doubling down against rivals.",
        "So the question becomes: Will Amazon's double-engine strategy beat the quick commerce giants, or is specialization the winning play?"
    ]
},

{
    "id": "124210343",
    "method": "story",
    "heading":"Trump proposes $100,000 fee on new H-1B visas",
    "category": "Prime",
    "story": "Donald Trump’s $100,000 H-1B visa fee stuns tech giants.\nForeign engineers power Amazon, Infosys, Cognizant, Tata – now blocked.\nAmerica’s global talent pipeline faces a sudden shutdown.\n\nEconomists warn this move slashes productivity and innovation.\nIn 2025, bottom 50% own just $4.2 trillion wealth.\nMeanwhile, the top 1% capture $51.9 trillion – gap doubles.\nManufacturing jobs vanish; labour force participation sinks year after year.\nRising tariffs haven’t rebuilt factories or boosted US jobs yet.\n\nDoes restricting foreign talent really “Make America Great Again”?\nIs identity politics overtaking sound economics? What’s your take?"
},

{
    "id": "124194334",
    "method": "keypoint",
    "heading":"Accenture cuts 11,000 jobs, earmarks $250 million severance",
    "category": "Prime",
    "keypoint": [
        "Accenture axes 11,000 roles; $250 million set for severance.",
        "TCS cuts surpass 12,000 jobs, hits senior employees hardest.",
        "Stock drops nearly 3% after slow 2%-5% FY26 growth forecast.",
        "GenAI investment hits $3 billion; FY25 revenue triples to $2.7 billion.",
        "Why this matters: Job security in Indian IT is collapsing as 23,000+ roles vanish and reskilling fails thousands."
    ]
},

{
    "id": "123880189",
    "method":"card",
    "heading":"EFC plans merger with Whitehill Interior, shareholder vote set",
    "category": "Prime",
    "card": [
        "INR10 lakh turns into INR545.6 crore in just eight months. Who gets rich? Here's what happened.",
        "EFC (I) was snapped up by Umesh Sahay and Abhishek Narbadia in April 2022. But then...",
        "Within six months, EFC launched Whitehill Interior (WIL) as a 51% subsidiary with INR10 lakh capital. Everything looked strategic. Until...",
        "Then, EFC's board approved a merger in July 2023 to bring WIL fully in-house. And it changed everything.",
        "Everyone thought this was about cost efficiency and control. They were wrong.",
        "The real reason? The merger boosts promoter shareholding from 45.46% to 60.45%—and hands them INR1,185 crore at INR314.15 per share.",
        "Within eight months, an INR10 lakh investment is valued at INR545.6 crore. That's a 5,550x jump. Eyebrows are raised everywhere.",
        "This reveals something bigger: valuation games can massively shift wealth—sometimes with minimal business performance to show.",
        "So the question becomes: Should public shareholders approve a merger based on future projections or demand harder proof?"
    ]
},

{
    "id": "124087922",
    "method":"story",
    "heading":"PVR Inox Q1 FY26 revenues rise 23% to INR1,488 crore",
    "category": "Prime",
    "story": "PVR Inox slashed net debt by nearly 40%: INR540 crore gone\nPopcorn tubs empty faster, halls fill up again\nBut 2023 looked like the end for India’s Box Office king\n\nThe real twist: INR124 crore earned from INR99 tickets\nSeven million extra viewers returned—manufactured demand, not just content\nINR1,488 crore revenue in Q1 FY26, up 23%\nAdmissions hit 34 million, average ticket price now INR254\n\nAamir Khan shuns OTT, pushes films only in theatres\nHollywood Box Office jumps 72% to INR200 crore\nPVR stock rebounds 40% in three months—survival to comeback\n\nCheap tickets, premium formats, and AI drive new growth\nCan the big screen keep beating streaming’s comfort?\nWill PVR’s heroics reshape India’s cinema culture?\nWhat’s your take on this blockbuster revival?"
},

{
    "id": "124273120",
    "method":"summary",
    "heading":"CAG audit finds INR13,362 crore loss in GNIDA",
    "category": "Prime",
    "Summary": "India's national auditor slammed Greater Noida's development authority for massive rule violations and financial mismanagement, exposing a staggering INR 13,362 crore revenue loss and overdue payments of INR 19,500 crore. The CAG report revealed irregular land acquisitions, flawed property pricing, and incomplete projects, with only 14 of 407 institutional plots finished by 2021. The findings demand accountability and signal urgent reforms in urban governance."
},


{
    "id": "124409415",
    "method":"keypoint",
    "heading":"Mahindra & Mahindra denies auto and tractor demerger plans",
    "category":"Free",
    "keypoint": [
        "Mahindra says 'no plan for demerger' after media reports.",
        "Synergies cited as reason to keep businesses together.",
        "Auto segment revenue share jumped from 35% to 57% FY21-FY25.",
        "Tractor EBIT contribution dropped from 74% to 27% FY21-FY25.",
        "Why this matters: Mahindra’s decision preserves $9.6 billion business synergies, impacting jobs and future growth across auto and tractor sectors."
    ]
},

{
    "id": "124355233",
    "method":"story",
    "heading":"Hyderabad neurologist links mood issues to Vitamin B12 deficiency",
    "category": "Free",
    "story": "A 33-year-old’s brain nearly crashed at 10 pmol/L\nHis family blamed stress, but something deadly hid deeper\nHow many “burnouts” are actually missed medical emergencies?\n\nDr Sudhir Kumar spots the truth: severe Vitamin B12 deficiency\nNormal is above 70 pmol/L—he had just 10 pmol/L\nForgetfulness, mood swings, poor focus: all linked to B12\nVegetarians face this risk far more than they realise\n\nWeeks after Vitamin B12 injections, his mind returns\nThousands in India mistake deficiency for normal stress every year\n\nHow many lives change if we check sooner?\nCould your diet be quietly stealing your energy?\nWhat’s your take—ever tested your B12 levels?"
},


{
    "id": "124409228",
    "method":"keypoint",
    "heading":"Cian Agro shares hit 12th straight upper circuit",
    "category": "Free",
    "keypoint": [
        "Stock hits 5% upper circuit at Rs 2,847 Thursday.",
        "Price jumps 1,400% in past 12 months trading.",
        "Only 30,000 shares traded vs 74,000 average.",
        "Cian Agro under Additional Surveillance Measure since September 11.",
        "Why this matters: Cian Agro’s meteoric 1,400% rise and trading curbs could signal volatility for retail investors."
    ]
},

{
    "id": "124407795",
    "method":"card",
    "heading":"UK to establish nine university campuses in India",
    "category": "Free",
    "card": [
        "Nine British universities are about to launch campuses in India. What does this mean for global education? Here's what happened.",
        "UK Prime Minister Keir Starmer arrives in Mumbai, backed by 125 top industry leaders. Britain's reputation? World-class higher education. But then...",
        "Starmer announces: nine British university campuses will open in India. Britain aims to lead international higher education. Everything seems set. Until...",
        "No new visa deal. Starmer makes it clear: the focus is not on visas, but something bigger. And it changes everything.",
        "Everyone thought this was about easier student migration. Or a new visa agreement. They were wrong.",
        "The real reason? Leveraging the UK-India Free Trade Agreement, signed in July, to boost collaboration and opportunity.",
        "Within months, new campuses spark research, innovation, and academic exchange. Students and professionals stand to benefit.",
        "This reveals something bigger: education is now a core strategy in global trade partnerships."
    ]
},


{
    "id": "124408583",
    "method":"story",
    "heading":"Premier League trains 30 community coaches in Mumbai",
    "category": "Free",
    "story": "Premier League trains 30 community coaches in Mumbai—first time ever.\nUK Prime Minister joins, praising football’s power to unite.\nBut the spotlight hides a bigger mission taking root.\n\nPremier League, FA, and Manchester United run 3-day program.\n80 children test new skills at Cooperage Football Ground.\nMumbai office now drives grassroots change, not just fandom.\nLocal leaders gain tools to inspire next-gen Indian players.\n\nCan British sport really transform lives across continents?\nWould your community embrace global partnerships like this?"
},

{
    "id": "124407631",
    "method":"summary",
    "heading":"Sri Lanka arrests 47 fishermen, seizes five trawlers",
    "category": "Free",
    "Summary": "Sri Lankan Navy arrested 47 fishermen and seized five trawlers at Talaimannar for allegedly entering the country's waters. The coordinated operation began late Wednesday and continued into Thursday morning. The Navy will hand over the fishermen and equipment to the fisheries inspectorate for further action. This incident underscores ongoing tensions over fishing rights between India and Sri Lanka."
},

{
    "id": "124406686",
    "method":"story",
    "heading": "Viral post criticizes manager's insensitive work directive",
    "category": "Free",
    "story": "“A manager demands: “Work unless you’re in the ICU.”\nHundreds react instantly—outraged, shocked, and sharing stories.\nHow does this message go viral overnight?\n\nA screenshot exposes the command on a top subreddit.\nYoung manager insists: ignore illness, solve tech issues anytime.\nThousands condemn the tone as toxic and unethical.\nOne user says: AI might manage people better.\n\nHR is urged to investigate for workplace harassment.\nThe post ignites a debate on empathy and leadership.\nAre we normalizing burnout for business goals?\n\nWho decides the limits of human resilience?\nWould you report this or stay silent?"
},

{
    "id": "124406606",
    "method":"summary",
    "heading":"Supreme Court to hear plea on toxic cough syrups",
    "category": "Free",
    "Summary": "The Supreme Court will hear a plea demanding a probe and systemic overhaul of drug safety after child deaths linked to toxic cough syrups. The petition urges a court-monitored investigation, transfer of all related cases to the CBI, and mandatory toxicological testing of suspect medicines. This case could trigger sweeping changes in how India regulates and monitors pharmaceutical safety."
}
]
